# OnCancelAction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TabbedDialogExtension..::..OnCancelAction Property
TabbedDialogExtension Class See Also
---
The cancel handler.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TabbedDialogAction OnCancelAction { get; set; }
```

Visual Basic
---
```text
Public Property OnCancelAction As TabbedDialogAction
	Get
	Set
```

Visual C++
---
```text
public:
property TabbedDialogAction^ OnCancelAction {
	TabbedDialogAction^ get ();
	void set (TabbedDialogAction^ value);
}
```

# Remarks
This handler will be invoked when the "Cancel" button in Revit options dialog is clicked. The Revit options dialog will be closed directly if this property was set to nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace